{
  "EMR": {
    "metadata": {
      "name": "Emerson Electric Co.",
      "summary": "Emerson Electric Co., a technology and software company, provides various solutions in the Americas, Asia, the Middle East, Africa, and Europe. It operates through Final Control, Measurement & Analytical, Discrete Automation, Safety & Productivity, Control Systems & Software, and Test & Measurement segments. The Final Control segment provides control valves, isolation valves, shutoff valves, pressure relief valves, pressure safety valves, actuators, and regulators for process and hybrid industries under Anderson Greenwood, Bettis, Crosby, Fisher, Keystone, KTM, and Vanessa brands. The Measurement & Analytical segment supplies intelligent instrumentation measuring the physical properties of liquids or gases, such as pressure, temperature, level, flow, acoustics, corrosion, pH, conductivity, water quality, toxic gases, and flame under the Flexim, Micro Motion, and Rosemount brands. The Discrete Automation segment includes solenoid valves, pneumatic valves, valve position indicators, pneumatic cylinders and actuators, air preparation equipment, pressure and temperature switches, electric linear motion solutions, programmable automation control systems and software, electrical distribution equipment, and materials joining solutions used primarily in discrete industries under the Afag, Appleton, ASCO, Aventics, Branson, Movicon, PACSystems, SolaHD, TESCOM, and TopWorx brands. The Safety & Productivity segment delivers tools for professionals and homeowners that support infrastructure, promote safety, and enhance productivity under the Greenlee, Klauke, ProTeam, and RIDGID brands. The Control Systems & Software segment provides control systems and software that control plant processes by collecting and analyzing information from measurement devices in the plant under the DeltaV and Ovation brands. The Test & Measurement offers software-connected automated test and measurement systems. The company was incorporated in 1890 and is headquartered in Saint Louis, Missouri.",
      "valuation": 84772659200,
      "ytd_growth": "0.0%",
      "total_return": "46.2%",
      "type": "Stock",
      "holdings": "N/A"
    },
    "prices": [
      {
        "date": "2024-02",
        "price": 103.12
      },
      {
        "date": "2024-03",
        "price": 110.0
      },
      {
        "date": "2024-04",
        "price": 104.53
      },
      {
        "date": "2024-05",
        "price": 108.78
      },
      {
        "date": "2024-06",
        "price": 107.33
      },
      {
        "date": "2024-07",
        "price": 114.1
      },
      {
        "date": "2024-08",
        "price": 102.68
      },
      {
        "date": "2024-09",
        "price": 107.1
      },
      {
        "date": "2024-10",
        "price": 106.02
      },
      {
        "date": "2024-11",
        "price": 129.85
      },
      {
        "date": "2024-12",
        "price": 121.85
      },
      {
        "date": "2025-01",
        "price": 127.77
      },
      {
        "date": "2025-02",
        "price": 119.57
      },
      {
        "date": "2025-03",
        "price": 108.26
      },
      {
        "date": "2025-04",
        "price": 103.79
      },
      {
        "date": "2025-05",
        "price": 117.88
      },
      {
        "date": "2025-06",
        "price": 132.23
      },
      {
        "date": "2025-07",
        "price": 144.31
      },
      {
        "date": "2025-08",
        "price": 130.91
      },
      {
        "date": "2025-09",
        "price": 130.61
      },
      {
        "date": "2025-10",
        "price": 138.97
      },
      {
        "date": "2025-11",
        "price": 132.8
      },
      {
        "date": "2025-12",
        "price": 132.72
      },
      {
        "date": "2026-01",
        "price": 150.76
      }
    ]
  },
  "HON": {
    "metadata": {
      "name": "Honeywell International Inc.",
      "summary": "Honeywell International Inc. engages in the aerospace technologies, industrial automation, building automation, and energy and sustainable solutions businesses in the United States, Europe, and internationally. The company's Aerospace Technologies segment offers auxiliary power units, propulsion engines, integrated avionics, environmental control and electric power systems, engine controls, flight safety, communications, navigation hardware, data and software applications, radar and surveillance systems, aircraft lighting, advanced systems and instruments, satellite and space components, and aircraft wheels and brakes; thermal systems; and spare parts; repair, overhaul, and maintenance services; and wireless connectivity services. Its Industrial Automation segment provides automation control and instrumentation products and services; smart energy products; sensing technologies with custom-engineered sensors and services; gas detection technologies and personal protective equipment; and system design automation equipment, as well as software and analytics for manufacturing, distribution, and fulfillment operations. Its Building Automation segment provides software applications for building control and optimization; sensors, switches, control systems, and instruments for energy management; access control; video surveillance; fire products; and installation, maintenance, and upgrade of systems. The company's Energy and Sustainability Solutions segment offers aviation fuels, petrochemical, refining, and natural gas liquefaction technologies; carbon management solutions; catalysts and adsorbents, equipment and aftermarket services; refrigeration and heating solutions; protective armor and medical applications; and semiconductor materials, as well as data integration and software solutions. Honeywell International Inc. was founded in 1885 and is headquartered in Charlotte, North Carolina.",
      "valuation": 153130156032,
      "ytd_growth": "0.0%",
      "total_return": "26.62%",
      "type": "Stock",
      "holdings": "N/A"
    },
    "prices": [
      {
        "date": "2024-02",
        "price": 179.47
      },
      {
        "date": "2024-03",
        "price": 186.38
      },
      {
        "date": "2024-04",
        "price": 175.01
      },
      {
        "date": "2024-05",
        "price": 183.6
      },
      {
        "date": "2024-06",
        "price": 194.93
      },
      {
        "date": "2024-07",
        "price": 186.91
      },
      {
        "date": "2024-08",
        "price": 189.79
      },
      {
        "date": "2024-09",
        "price": 189.73
      },
      {
        "date": "2024-10",
        "price": 188.78
      },
      {
        "date": "2024-11",
        "price": 213.79
      },
      {
        "date": "2024-12",
        "price": 208.35
      },
      {
        "date": "2025-01",
        "price": 206.35
      },
      {
        "date": "2025-02",
        "price": 196.36
      },
      {
        "date": "2025-03",
        "price": 196.36
      },
      {
        "date": "2025-04",
        "price": 195.2
      },
      {
        "date": "2025-05",
        "price": 210.19
      },
      {
        "date": "2025-06",
        "price": 217.05
      },
      {
        "date": "2025-07",
        "price": 207.24
      },
      {
        "date": "2025-08",
        "price": 204.58
      },
      {
        "date": "2025-09",
        "price": 197.22
      },
      {
        "date": "2025-10",
        "price": 200.13
      },
      {
        "date": "2025-11",
        "price": 191.05
      },
      {
        "date": "2025-12",
        "price": 195.09
      },
      {
        "date": "2026-01",
        "price": 227.24
      }
    ]
  },
  "SIEGY": {
    "metadata": {
      "name": "Siemens Aktiengesellschaft",
      "summary": "Siemens Aktiengesellschaft, a technology company, focuses in the areas of automation and digitalization in Europe, Commonwealth of Independent States, Africa, the Middle East, the Americas, Asia, and Australia. It operates through Digital Industries, Smart Infrastructure, Mobility, Siemens Healthineers, and Siemens Financial Services (SFS) segments. The Digital Industries segment provides automation systems and software for factories, numerical control systems, servo motors, drives and inverters, and integrated automation systems for machine tools and production machines; process control systems, machine-to-machine communication products, sensors and radio frequency identification systems; production and product lifecycle management software, and simulation and testing of mechatronic system. The Smart Infrastructure segment offers products, systems, solutions, services, and software to support sustainable transition from fossil and renewable energy  sources; sustainable buildings and communities; and buildings, electrification, and electrical products. The Mobility segment provides rail passenger and freight transportation, such as metro systems, trams and light rail, and commuter trains, as well as trains and passenger coaches; locomotives and solutions for automated transportation and leasing; products and solutions for rail automation and electrification; maintenance and digital services; and digital and cloud-based solutions, and related services. The Siemens Healthineers segment develops, manufactures, and sells various diagnostic and therapeutic products and services; and provides clinical consulting and training services. The Siemens Financial Services segment offers debt and equity investments; leasing, lending, and working capital; structured, equipment, and project financing; and financial advisory services. The company was founded in 1847 and is headquartered in Munich, Germany.",
      "valuation": 239993651200,
      "ytd_growth": "0.0%",
      "total_return": "63.76%",
      "type": "Stock",
      "holdings": "N/A"
    },
    "prices": [
      {
        "date": "2024-02",
        "price": 93.91
      },
      {
        "date": "2024-03",
        "price": 93.25
      },
      {
        "date": "2024-04",
        "price": 91.43
      },
      {
        "date": "2024-05",
        "price": 94.33
      },
      {
        "date": "2024-06",
        "price": 91.12
      },
      {
        "date": "2024-07",
        "price": 89.31
      },
      {
        "date": "2024-08",
        "price": 92.03
      },
      {
        "date": "2024-09",
        "price": 98.74
      },
      {
        "date": "2024-10",
        "price": 94.85
      },
      {
        "date": "2024-11",
        "price": 94.81
      },
      {
        "date": "2024-12",
        "price": 94.47
      },
      {
        "date": "2025-01",
        "price": 104.41
      },
      {
        "date": "2025-02",
        "price": 111.26
      },
      {
        "date": "2025-03",
        "price": 115.38
      },
      {
        "date": "2025-04",
        "price": 115.25
      },
      {
        "date": "2025-05",
        "price": 120.96
      },
      {
        "date": "2025-06",
        "price": 128.87
      },
      {
        "date": "2025-07",
        "price": 127.85
      },
      {
        "date": "2025-08",
        "price": 138.88
      },
      {
        "date": "2025-09",
        "price": 135.01
      },
      {
        "date": "2025-10",
        "price": 141.69
      },
      {
        "date": "2025-11",
        "price": 132.64
      },
      {
        "date": "2025-12",
        "price": 139.95
      },
      {
        "date": "2026-01",
        "price": 153.79
      }
    ]
  },
  "KEYS": {
    "metadata": {
      "name": "Keysight Technologies, Inc.",
      "summary": "Keysight Technologies, Inc. provides electronic design and test solutions worldwide. The company operates through Communications Solutions Group and Electronic Industrial Solutions Group segments. It offers electronic design and test software, instrumentation, systems, and related services used in the design, simulation, validation, manufacturing, installation, and optimization of communication systems in wireless, data center ecosystem, enterprise, and aerospace, defense, and government end markets. The company also develops and deploys communications products and services; and operates communications networks. In addition, it provides electronic design, test and simulation software, instrumentation, systems, computer-aided engineering solutions, and related services used in the design, simulation, validation, manufacturing, installation, and optimization of electronic equipment in the automotive and energy, semiconductor solutions, and general electronics industries. Further, the company offers product support; technical and application support for hardware, software, and solutions; and professional services, such as installation, training, engineering, optimization of equipment and solution adoption, utilization, and integration services. Additionally, it provides oscilloscopes; generators, sources and power supplies; software products; analyzers; wireless products; network test and security; modular instruments; meters; network visibility; and other products, as well as KeysightCare support plans, calibration, repair, technology refresh, test as a service, network/security, consulting, financial alternatives, education, software testing, support, managed, device vulnerability analysis, support portal, and used equipment services. Keysight Technologies, Inc. was founded in 1939 and is headquartered in Santa Rosa, California.",
      "valuation": 38011101184,
      "ytd_growth": "0.0%",
      "total_return": "43.38%",
      "type": "Stock",
      "holdings": "N/A"
    },
    "prices": [
      {
        "date": "2024-02",
        "price": 154.3
      },
      {
        "date": "2024-03",
        "price": 156.38
      },
      {
        "date": "2024-04",
        "price": 147.94
      },
      {
        "date": "2024-05",
        "price": 138.48
      },
      {
        "date": "2024-06",
        "price": 136.75
      },
      {
        "date": "2024-07",
        "price": 139.57
      },
      {
        "date": "2024-08",
        "price": 154.12
      },
      {
        "date": "2024-09",
        "price": 158.93
      },
      {
        "date": "2024-10",
        "price": 149.01
      },
      {
        "date": "2024-11",
        "price": 170.84
      },
      {
        "date": "2024-12",
        "price": 160.63
      },
      {
        "date": "2025-01",
        "price": 178.35
      },
      {
        "date": "2025-02",
        "price": 159.53
      },
      {
        "date": "2025-03",
        "price": 149.77
      },
      {
        "date": "2025-04",
        "price": 145.4
      },
      {
        "date": "2025-05",
        "price": 157.04
      },
      {
        "date": "2025-06",
        "price": 163.86
      },
      {
        "date": "2025-07",
        "price": 163.91
      },
      {
        "date": "2025-08",
        "price": 163.43
      },
      {
        "date": "2025-09",
        "price": 174.92
      },
      {
        "date": "2025-10",
        "price": 182.96
      },
      {
        "date": "2025-11",
        "price": 197.95
      },
      {
        "date": "2025-12",
        "price": 203.19
      },
      {
        "date": "2026-01",
        "price": 221.23
      }
    ]
  }
}