{
  "TRMB": {
    "metadata": {
      "name": "Trimble Inc.",
      "summary": "Trimble Inc. provides technology solutions that enable professionals and field mobile workers to enhance or transform their work processes in North America, Europe, the Asia Pacific, and internationally. The company offers architecture design, engineering, construction, and owner software products. It also offers field-based data collection systems and field software, and real-time communications systems, as well as back-office software for data processing, modeling, monitoring, reporting, and analysis; software for planning, data processing and editing, quality control, 3D modeling, intelligent data analysis and AI-based feature extraction, deformation monitoring, project reporting, and data export; field and office software for project design and visualization; office-based products, such as software for 3D design and data sharing; systems to guide and control construction equipment; and software to facilitate the management of the construction process. In addition, it offers positioning services, such as VRSNow; CenterPoint RTX; FieldPoint RTX; Rangepoint RTX; ViewPoint RTX; Trimble xFill; and OmniSTAR (HP, XP, G2, and VBS) services. Further, it offers transportation management system that automates business processes for shippers, carriers, and intermediaries, as well as truck routing, mileage, mapping, and voice navigation solutions; and transporeon solutions that offers freight sourcing and procurement, such as dock and yard management, and freight auditing. It serves architecture, engineering, construction, design, asset management, operations, and maintenance; private, commercial, and government; and shippers, carriers, and intermediaries customers. It sells its technology solutions directly to its customers in central Illinois, eastern Iowa, and northeast Missouri. The company was formerly known as Trimble Navigation Limited and changed its name to Trimble Inc. in October 2016. Trimble Inc. was founded in 1978 and is headquartered in Westminster, Colorado.",
      "valuation": 16269946880,
      "ytd_growth": "0.0%",
      "total_return": "11.73%",
      "type": "Stock",
      "holdings": "N/A"
    },
    "prices": [
      {
        "date": "2024-02",
        "price": 61.19
      },
      {
        "date": "2024-03",
        "price": 64.36
      },
      {
        "date": "2024-04",
        "price": 60.07
      },
      {
        "date": "2024-05",
        "price": 55.68
      },
      {
        "date": "2024-06",
        "price": 55.92
      },
      {
        "date": "2024-07",
        "price": 54.54
      },
      {
        "date": "2024-08",
        "price": 56.69
      },
      {
        "date": "2024-09",
        "price": 62.09
      },
      {
        "date": "2024-10",
        "price": 60.5
      },
      {
        "date": "2024-11",
        "price": 72.97
      },
      {
        "date": "2024-12",
        "price": 70.66
      },
      {
        "date": "2025-01",
        "price": 74.96
      },
      {
        "date": "2025-02",
        "price": 71.98
      },
      {
        "date": "2025-03",
        "price": 65.65
      },
      {
        "date": "2025-04",
        "price": 62.14
      },
      {
        "date": "2025-05",
        "price": 71.27
      },
      {
        "date": "2025-06",
        "price": 75.98
      },
      {
        "date": "2025-07",
        "price": 83.89
      },
      {
        "date": "2025-08",
        "price": 80.82
      },
      {
        "date": "2025-09",
        "price": 81.65
      },
      {
        "date": "2025-10",
        "price": 79.75
      },
      {
        "date": "2025-11",
        "price": 81.42
      },
      {
        "date": "2025-12",
        "price": 78.35
      },
      {
        "date": "2026-01",
        "price": 68.37
      }
    ]
  },
  "GRMN": {
    "metadata": {
      "name": "Garmin Ltd.",
      "summary": "Garmin Ltd. designs, develops, manufactures, markets, and distributes a range of wireless devices worldwide. The company offers running and multi-sport watches; cycling products; smartwatch devices; scales and monitors; Garmin Connect and Garmin Connect Mobile, which are web and mobile platforms where users can track and analyze their fitness, activities and workouts, and wellness data; and Connect IQ, enables third parties to create applications that run on Garmin devices. It also provides adventure watches; outdoor handhelds and satellite communicators; golf devices; consumer automotive; dog devices; InReach and Gramin response communication device; and Dive devices. In addition, the company designs, manufactures, and markets various aircraft avionics solutions, including integrated flight decks, electronic flight displays and instrumentation, navigation and communication products, automatic flight control systems and safety-enhancing technologies, audio control systems, engine indication systems, traffic awareness and avoidance solutions, ADS-B and transponders, weather information and avoidance solutions, datalink and connectivity solutions, and portable GPS navigators and wearables, as well as service products to the aviation market. Further, it offers chartplotters and multi-function displays, cartography products, fishfinders, sonar products, autopilot systems, radars, compliant instrument displays and sensors, VHF communication radios, handhelds and wearable devices, sailing products, audio products, digital switching products, trolling motors, and lighting products; and domain controllers and infotainment units, as well as software, map database, cameras, wearables, and automotive solutions. The company sells its products through independent retailers, dealers, distributors, installation and repair shops, and original equipment manufacturers, as well as online webshop. Garmin Ltd. was founded in 1989 and is based in Schaffhausen, Switzerland.",
      "valuation": 39393886208,
      "ytd_growth": "0.0%",
      "total_return": "54.05%",
      "type": "Stock",
      "holdings": "N/A"
    },
    "prices": [
      {
        "date": "2024-02",
        "price": 132.85
      },
      {
        "date": "2024-03",
        "price": 143.99
      },
      {
        "date": "2024-04",
        "price": 140.43
      },
      {
        "date": "2024-05",
        "price": 159.26
      },
      {
        "date": "2024-06",
        "price": 158.36
      },
      {
        "date": "2024-07",
        "price": 167.24
      },
      {
        "date": "2024-08",
        "price": 179.0
      },
      {
        "date": "2024-09",
        "price": 171.91
      },
      {
        "date": "2024-10",
        "price": 194.51
      },
      {
        "date": "2024-11",
        "price": 208.48
      },
      {
        "date": "2024-12",
        "price": 202.26
      },
      {
        "date": "2025-01",
        "price": 212.41
      },
      {
        "date": "2025-02",
        "price": 225.28
      },
      {
        "date": "2025-03",
        "price": 213.67
      },
      {
        "date": "2025-04",
        "price": 184.55
      },
      {
        "date": "2025-05",
        "price": 200.45
      },
      {
        "date": "2025-06",
        "price": 206.13
      },
      {
        "date": "2025-07",
        "price": 217.01
      },
      {
        "date": "2025-08",
        "price": 239.89
      },
      {
        "date": "2025-09",
        "price": 244.25
      },
      {
        "date": "2025-10",
        "price": 213.03
      },
      {
        "date": "2025-11",
        "price": 194.49
      },
      {
        "date": "2025-12",
        "price": 201.98
      },
      {
        "date": "2026-01",
        "price": 204.65
      }
    ]
  },
  "CGNX": {
    "metadata": {
      "name": "Cognex Corporation",
      "summary": "Cognex Corporation provides machine vision products that capture and analyze visual information to automate manufacturing and distribution tasks worldwide. Its machine vision products are used to automate the manufacturing and tracking of discrete items, including mobile phones, automotive components, and e-commerce packages by locating, identifying, inspecting, and measuring them. The company offers VisionPro software, a suite of patented vision tools for advanced programming; In-Sight product line of vision systems and sensors; QuickBuild that allows customers to build vision applications with a graphical, flowchart-based programming interface; and DataMan, an image-based barcode readers and barcode verifiers; vision accessories, such as industrial cameras, lenses, lighting, vision controllers, frame grabbers, and I/O cards. It sells its products to automotive, logistics, consumer electronics, medical-related, semiconductor, consumer products, and food and beverage industries through a network of distributors and integrators. The company was incorporated in 1981 and is headquartered in Natick, Massachusetts.",
      "valuation": 6551407616,
      "ytd_growth": "0.0%",
      "total_return": "0.72%",
      "type": "Stock",
      "holdings": "N/A"
    },
    "prices": [
      {
        "date": "2024-02",
        "price": 38.81
      },
      {
        "date": "2024-03",
        "price": 41.81
      },
      {
        "date": "2024-04",
        "price": 40.94
      },
      {
        "date": "2024-05",
        "price": 44.87
      },
      {
        "date": "2024-06",
        "price": 46.16
      },
      {
        "date": "2024-07",
        "price": 48.99
      },
      {
        "date": "2024-08",
        "price": 39.87
      },
      {
        "date": "2024-09",
        "price": 40.06
      },
      {
        "date": "2024-10",
        "price": 39.79
      },
      {
        "date": "2024-11",
        "price": 39.55
      },
      {
        "date": "2024-12",
        "price": 35.54
      },
      {
        "date": "2025-01",
        "price": 39.54
      },
      {
        "date": "2025-02",
        "price": 32.51
      },
      {
        "date": "2025-03",
        "price": 29.64
      },
      {
        "date": "2025-04",
        "price": 27.12
      },
      {
        "date": "2025-05",
        "price": 29.77
      },
      {
        "date": "2025-06",
        "price": 31.59
      },
      {
        "date": "2025-07",
        "price": 40.61
      },
      {
        "date": "2025-08",
        "price": 43.76
      },
      {
        "date": "2025-09",
        "price": 45.2
      },
      {
        "date": "2025-10",
        "price": 41.3
      },
      {
        "date": "2025-11",
        "price": 38.02
      },
      {
        "date": "2025-12",
        "price": 35.98
      },
      {
        "date": "2026-01",
        "price": 39.09
      }
    ]
  },
  "MTLS": {
    "metadata": {
      "name": "Materialise NV",
      "summary": "Materialise NV provides additive manufacturing and medical software tools, and 3D printing services in the Americas, Europe, Africa, and the Asia-Pacific. The company operates through three segments: Materialise Software, Materialise Medical, and Materialise Manufacturing. The Materialise Software segment offers software through programs and platforms that enable and enhance the functionality of 3D printers, and printing operations. Its software interfaces between various types of 3D printers; and various software applications and capturing technologies, including computer-aided design/computer-aided manufacturing packages and 3D scanners; a MES, software providers. This segment serves 3D printing machine manufacturers; production companies and contract manufacturers in automotive, aerospace, consumer goods, and hearing aid industries; and 3D printing service bureaus through its sales force, website, and third-party distributors. The Materialise Medical segment provides medical software that allows medical-image based analysis, planning, and engineering, as well as patient-specific design and printing of surgical devices and implants. It serves medical device companies, hospitals, universities, research institutes, and industrial companies through its direct sales force, website, and picture archiving and communication system. The Materialise Manufacturing segment provides 3D printing services, design and engineering services, and rapid prototyping and additive manufacturing of production parts to customers serving the automotive, consumer goods industrial goods, semiconductor, art and architecture and aerospace markets. The company has collaboration agreements with Zimmer Biomet Holdings, Inc.; Encore Medical, L.P.; DePuy Synthes Companies of Johnson & Johnson; Limacorporate Spa; Mathys AG; Smith & Nephew Inc.; Corin Ltd; Medtronic Inc.; and Abbott Laboratories Inc. Materialise NV was incorporated in 1990 and is headquartered in Leuven, Belgium.",
      "valuation": 345942144,
      "ytd_growth": "0.0%",
      "total_return": "2.78%",
      "type": "Stock",
      "holdings": "N/A"
    },
    "prices": [
      {
        "date": "2024-02",
        "price": 5.4
      },
      {
        "date": "2024-03",
        "price": 5.28
      },
      {
        "date": "2024-04",
        "price": 5.22
      },
      {
        "date": "2024-05",
        "price": 5.0
      },
      {
        "date": "2024-06",
        "price": 5.01
      },
      {
        "date": "2024-07",
        "price": 6.5
      },
      {
        "date": "2024-08",
        "price": 5.35
      },
      {
        "date": "2024-09",
        "price": 5.48
      },
      {
        "date": "2024-10",
        "price": 5.91
      },
      {
        "date": "2024-11",
        "price": 7.63
      },
      {
        "date": "2024-12",
        "price": 7.04
      },
      {
        "date": "2025-01",
        "price": 8.38
      },
      {
        "date": "2025-02",
        "price": 5.26
      },
      {
        "date": "2025-03",
        "price": 4.92
      },
      {
        "date": "2025-04",
        "price": 5.14
      },
      {
        "date": "2025-05",
        "price": 5.39
      },
      {
        "date": "2025-06",
        "price": 5.65
      },
      {
        "date": "2025-07",
        "price": 5.16
      },
      {
        "date": "2025-08",
        "price": 5.11
      },
      {
        "date": "2025-09",
        "price": 5.57
      },
      {
        "date": "2025-10",
        "price": 6.4
      },
      {
        "date": "2025-11",
        "price": 6.03
      },
      {
        "date": "2025-12",
        "price": 5.55
      },
      {
        "date": "2026-01",
        "price": 5.55
      }
    ]
  },
  "ARBE": {
    "metadata": {
      "name": "Arbe Robotics Ltd.",
      "summary": "Arbe Robotics Ltd., a semiconductor company, provides 4D imaging radar solutions to suppliers of parts or systems, autonomous ground vehicles, and commercial and industrial vehicles in China, Sweden, Germany, the United States, Israel, and internationally. It offers a radar chipset, including transmitter (Tx), receiver (Rx), and processor chips; the Phoenix perception radar for free space mapping, object tracking, and simultaneous localization and mapping; and Lynx, a 4D imaging radar for corner and back installation. The company also develops radar chipsets for integration into advanced driver assistance systems (ADAS) and autonomous vehicles (AV) sensor suites, as well as an array of safety applications with sensing and paradigm-changing perception. Further, it develops multi-channel radio frequency integrated circuit. The company was founded in 2015 and is headquartered in Tel Aviv-Yafo, Israel.",
      "valuation": 159137040,
      "ytd_growth": "0.0%",
      "total_return": "-33.33%",
      "type": "Stock",
      "holdings": "N/A"
    },
    "prices": [
      {
        "date": "2024-02",
        "price": 1.95
      },
      {
        "date": "2024-03",
        "price": 2.09
      },
      {
        "date": "2024-04",
        "price": 1.79
      },
      {
        "date": "2024-05",
        "price": 2.0
      },
      {
        "date": "2024-06",
        "price": 1.91
      },
      {
        "date": "2024-07",
        "price": 2.12
      },
      {
        "date": "2024-08",
        "price": 2.0
      },
      {
        "date": "2024-09",
        "price": 1.91
      },
      {
        "date": "2024-10",
        "price": 1.82
      },
      {
        "date": "2024-11",
        "price": 1.79
      },
      {
        "date": "2024-12",
        "price": 1.86
      },
      {
        "date": "2025-01",
        "price": 2.56
      },
      {
        "date": "2025-02",
        "price": 1.85
      },
      {
        "date": "2025-03",
        "price": 1.03
      },
      {
        "date": "2025-04",
        "price": 1.33
      },
      {
        "date": "2025-05",
        "price": 1.65
      },
      {
        "date": "2025-06",
        "price": 1.78
      },
      {
        "date": "2025-07",
        "price": 1.35
      },
      {
        "date": "2025-08",
        "price": 1.3
      },
      {
        "date": "2025-09",
        "price": 1.65
      },
      {
        "date": "2025-10",
        "price": 1.96
      },
      {
        "date": "2025-11",
        "price": 1.47
      },
      {
        "date": "2025-12",
        "price": 1.18
      },
      {
        "date": "2026-01",
        "price": 1.3
      }
    ]
  }
}